sklosky-nl/sound-monitoring-mesh/firmware/sound-level-sensor/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_WIFI_SSID="YOUR_WIFI_SSID"
CONFIG_WIFI_PASSWORD="REDACTED"
CONFIG_SERVER_URL="http://Awesome-Macbook.local:3000"
CONFIG_API_KEY="REDACTED"

# Flash Configuration - 4MB for OTA support
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Partition Table - Custom OTA partitions
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
